In [196]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [197]:
df_train = pd.read_csv('dataset/train.csv')
df_test = pd.read_csv('dataset/test.csv')

In [198]:
df_train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [199]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [200]:
df_train['Gender'].unique()

array(['Male', 'Female', nan], dtype=object)

In [201]:
df_train['Gender'].isnull().sum()

13

In [202]:
df_train.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [203]:
df_train['Gender'] = df_train['Gender'].fillna(df_train['Gender'].mode()[0])
df_test['Gender'] = df_test['Gender'].fillna(df_train['Gender'].mode()[0])

In [204]:
df_train['Gender'].isnull().sum()

0

In [205]:
df_train['Married'] = df_train['Married'].fillna(df_train['Married'].mode()[0])
df_test['Married'] = df_test['Married'].fillna(df_train['Married'].mode()[0])

In [206]:
df_train['Married'].isnull().sum()

0

In [207]:
df_train['Dependents'].unique()

array(['0', '1', '2', '3+', nan], dtype=object)

In [208]:
df_train['Dependents'].value_counts()

Dependents
0     345
1     102
2     101
3+     51
Name: count, dtype: int64

In [209]:
df_train['Dependents'] = df_train['Dependents'].fillna(0)
df_test['Dependents'] = df_test['Dependents'].fillna(0)

In [210]:
df_train['Dependents'].isnull().sum()

0

In [211]:
df_train['Self_Employed'].unique()

array(['No', 'Yes', nan], dtype=object)

In [212]:
df_train['Self_Employed'] = df_train['Self_Employed'].fillna(df_train['Self_Employed'].mode()[0])
df_test['Self_Employed'] = df_test['Self_Employed'].fillna(df_train['Self_Employed'].mode()[0])

In [213]:
df_train['Self_Employed'].isnull().sum()

0

In [214]:
df_train.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [215]:
# if we see here the lean amount has different mean and median, mean is greater than median that means the data is 
# right skewed. Also mean is sensitive to outliers and the max value is way too off with 75 percentile, that means,
# 700 is very off. It better to replace the missing vlaues with median.
df_train['LoanAmount'] = df_train['LoanAmount'].fillna(df_train['LoanAmount'].median())
df_test['LoanAmount'] = df_test['LoanAmount'].fillna(df_train['LoanAmount'].median())

In [216]:
df_train['Loan_Amount_Term'].unique()

array([360., 120., 240.,  nan, 180.,  60., 300., 480.,  36.,  84.,  12.])

In [217]:
# loan term is the number of days the loan is given , so categorical variable that can be measured. 
# Using mode would be the correct option here
df_train['Loan_Amount_Term'] = df_train['Loan_Amount_Term'].fillna(df_train['Loan_Amount_Term'].mode()[0])
df_test['Loan_Amount_Term'] = df_test['Loan_Amount_Term'].fillna(df_train['Loan_Amount_Term'].mode()[0])

In [218]:
df_train['Credit_History'].unique()

array([ 1.,  0., nan])

In [219]:
# credit histiry is like yes or no so we should replace it with the mode
df_train['Credit_History'] = df_train['Credit_History'].fillna(df_train['Credit_History'].mode()[0])
df_test['Credit_History'] = df_test['Credit_History'].fillna(df_train['Credit_History'].mode()[0])

In [220]:
df_train.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [221]:
df_test.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
dtype: int64

In [222]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             614 non-null    object
 2   Married            614 non-null    object
 3   Dependents         614 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      614 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         614 non-null    float64
 9   Loan_Amount_Term   614 non-null    float64
 10  Credit_History     614 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [223]:
df_train['Gender'] = df_train['Gender'].map({'Male':0, 'Female':1})

In [224]:
df_train['Married'] = (df_train['Married'] == 'Yes').astype(int)

In [225]:
df_train['Education'].unique()

array(['Graduate', 'Not Graduate'], dtype=object)

In [226]:
df_train['Education'] = df_train['Education'].map({'Not Graduate':0,'Graduate':1})

In [227]:
df_train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,0,0,1,No,5849,0.0,128.0,360.0,1.0,Urban,Y
1,LP001003,0,1,1,1,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,0,1,0,1,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,0,1,0,0,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,0,0,0,1,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [228]:
df_train['Self_Employed'] = (df_train['Self_Employed'] == 'No').astype(int)

In [229]:
df_train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,0,0,0,1,1,5849,0.0,128.0,360.0,1.0,Urban,Y
1,LP001003,0,1,1,1,1,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,0,1,0,1,0,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,0,1,0,0,1,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,0,0,0,1,1,6000,0.0,141.0,360.0,1.0,Urban,Y

In [230]:
df_train['Property_Area'].unique()

array(['Urban', 'Rural', 'Semiurban'], dtype=object)

In [231]:
df_property = pd.get_dummies(df_train['Property_Area'], drop_first= True,dtype=int)

In [232]:
df_train = pd.concat([df_train,df_property],axis=1)

In [233]:
df_train

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Semiurban,Urban
0,LP001002,0,0,0,1,1,5849,0.0,128.0,360.0,1.0,Urban,Y,0,1
1,LP001003,0,1,1,1,1,4583,1508.0,128.0,360.0,1.0,Rural,N,0,0
2,LP001005,0,1,0,1,0,3000,0.0,66.0,360.0,1.0,Urban,Y,0,1
3,LP001006,0,1,0,0,1,2583,2358.0,120.0,360.0,1.0,Urban,Y,0,1
4,LP001008,0,0,0,1,1,6000,0.0,141.0,360.0,1.0,Urban,Y,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,1,0,0,1,1,2900,0.0,71.0,360.0,1.0,Rural,Y,0,0
610,LP002979,0,1,3+,1,1,4106,0.0,40.0,180.0,1.0,Rural,Y,0,0
611,LP002983,0,1,1,1,1,8072,240.0,253.0,360.0,1.0,Urban,Y,0,1
612,LP002984,0,1,2,1,1,7583,0.0,187.0,360.0,1.0,Urban,Y,0,1
613,LP002990,1,0,0,1,0,4583,0.0,133.0,360.0,0.0,Semiurban,N,1,0

In [234]:
df_train  = df_train.drop('Property_Area', axis = 1)

In [235]:
df_train['Loan_Status'] = (df_train['Loan_Status'] == 'N').astype(int)

In [236]:
df_train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Semiurban,Urban
0,LP001002,0,0,0,1,1,5849,0.0,128.0,360.0,1.0,0,0,1
1,LP001003,0,1,1,1,1,4583,1508.0,128.0,360.0,1.0,1,0,0
2,LP001005,0,1,0,1,0,3000,0.0,66.0,360.0,1.0,0,0,1
3,LP001006,0,1,0,0,1,2583,2358.0,120.0,360.0,1.0,0,0,1
4,LP001008,0,0,0,1,1,6000,0.0,141.0,360.0,1.0,0,0,1

In [237]:
df_test['Gender'] = df_test['Gender'].map({'Male':0, 'Female':1})
df_test['Married'] = (df_test['Married'] == 'Yes').astype(int)
df_test['Self_Employed'] = (df_test['Self_Employed'] == 'No').astype(int)
df_property_test = pd.get_dummies(df_test['Property_Area'], drop_first= True,dtype=int)

In [238]:
df_test = pd.concat([df_test,df_property_test],axis =1)

In [239]:
df_test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Semiurban,Urban
0,LP001015,0,1,0,Graduate,1,5720,0,110.0,360.0,1.0,Urban,0,1
1,LP001022,0,1,1,Graduate,1,3076,1500,126.0,360.0,1.0,Urban,0,1
2,LP001031,0,1,2,Graduate,1,5000,1800,208.0,360.0,1.0,Urban,0,1
3,LP001035,0,1,2,Graduate,1,2340,2546,100.0,360.0,1.0,Urban,0,1
4,LP001051,0,0,0,Not Graduate,1,3276,0,78.0,360.0,1.0,Urban,0,1

In [242]:
df_test['Education'] = df_test['Education'].map({'Not Graduate':0,'Graduate':1})

In [244]:
df_test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Semiurban,Urban
0,LP001015,0,1,0,1,1,5720,0,110.0,360.0,1.0,Urban,0,1
1,LP001022,0,1,1,1,1,3076,1500,126.0,360.0,1.0,Urban,0,1
2,LP001031,0,1,2,1,1,5000,1800,208.0,360.0,1.0,Urban,0,1
3,LP001035,0,1,2,1,1,2340,2546,100.0,360.0,1.0,Urban,0,1
4,LP001051,0,0,0,0,1,3276,0,78.0,360.0,1.0,Urban,0,1

In [245]:
df_test = df_test.drop('Property_Area', axis =1)

In [246]:
df_test.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Semiurban,Urban
0,LP001015,0,1,0,1,1,5720,0,110.0,360.0,1.0,0,1
1,LP001022,0,1,1,1,1,3076,1500,126.0,360.0,1.0,0,1
2,LP001031,0,1,2,1,1,5000,1800,208.0,360.0,1.0,0,1
3,LP001035,0,1,2,1,1,2340,2546,100.0,360.0,1.0,0,1
4,LP001051,0,0,0,0,1,3276,0,78.0,360.0,1.0,0,1

In [247]:
df_train.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Semiurban,Urban
0,LP001002,0,0,0,1,1,5849,0.0,128.0,360.0,1.0,0,0,1
1,LP001003,0,1,1,1,1,4583,1508.0,128.0,360.0,1.0,1,0,0
2,LP001005,0,1,0,1,0,3000,0.0,66.0,360.0,1.0,0,0,1
3,LP001006,0,1,0,0,1,2583,2358.0,120.0,360.0,1.0,0,0,1
4,LP001008,0,0,0,1,1,6000,0.0,141.0,360.0,1.0,0,0,1